---
kind: method
id: M:Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData.#ctor
source: html/69bdb67a-57f1-1f9b-30ba-37d6c71c34db.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData.#ctor Method

Creates empty StructuralElementDefinitionData object.

## Syntax (C#)
```csharp
public StructuralElementDefinitionData()
```